app/controllers/hampsters_controller.rb

SELECT "hampsters".* FROM "hampsters"
---
  def index
    @hampsters = Hampster.all