app/controllers/hamsters_controller.rb

SELECT "hamsters".* FROM "hamsters"
---
  def index
    @hamsters = Hamster.all

INSERT INTO "hamsters" ("name", "color", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdf"], ["color", "asdf"], ["created_at", "2017-09-27 00:41:20.417549"], ["updated_at", "2017-09-27 00:41:20.417549"], ["user_id", 2]]
---
  def create
    puts '------Creating new hamster-------- '
    @hamster = Hamster.new(hamster_params)
    @hamster.user_id = params[:user_id]
    if @hamster.save

UPDATE "hamsters" SET "name" = $1, "color" = $2, "updated_at" = $3 WHERE "hamsters"."id" = $4  [["name", "vero"], ["color", "vero"], ["updated_at", "2017-09-28 01:11:34.346469"], ["id", 13]]
---
  def update
    puts '---- PUT /hamsters/:id update ---'
    if @hamster.update(hamster_params)

SELECT  "hamsters".* FROM "hamsters" WHERE "hamsters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hamsters" WHERE "hamsters"."id" = $1  [["id", 10]]
---
  def destroy
    puts "------DELETING HAMSTER--------------"
    puts @hamster.user_id
    @hamster = Hamster.find(params[:id])
    @hamster.destroy

SELECT  "hamsters".* FROM "hamsters" WHERE "hamsters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_hamster
      @hamster = Hamster.find(params[:id])