app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Admin"], ["LIMIT", 1]]
---
  def login
    puts '--- LOGIN ---'
    # params.each do |i|
    #   puts i
    # end
    puts user = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "AJ"], ["password_digest", "$2a$10$qYdqSB0BY5VbOpLPzXPp8O3q889.Z/9tb4MF7On2k.SwlctIpgb4u"], ["created_at", "2017-09-26 04:39:07.033477"], ["updated_at", "2017-09-26 04:39:07.033477"]]
---
  def create
    puts params[:username]
    puts params[:password]
    @user = User.new(username: params[:username].to_s, password: params[:password])

    if @user.save